results/nicolò/mongo/workloadf/rc10000_oc10000_fc10_fl100_raftrue/load_rep3_2025-05-15_15-42-19.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
/opt/java/openjdk/bin/java -cp /opt/YCSB_PROJECT_ROOT/mongodb/conf:/opt/YCSB_PROJECT_ROOT/mongodb/target/mongodb-binding-0.17.0.jar:/root/.m2/repository/org/mongodb/mongo-java-driver/3.8.0/mongo-java-driver-3.8.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/opt/YCSB_PROJECT_ROOT/core/target/core-0.17.0.jar:/root/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/root/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadf -p recordcount=10000 -p operationcount=10000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -p mongodb.batchsize=500 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadf -p recordcount=10000 -p operationcount=10000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -p mongodb.batchsize=500 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
<<<<<<< HEAD:results/nicolò/mongo/workloadf/rc10000_oc10000_fc10_fl100_raftrue/load_rep3_2025-05-15_15-42-19.txt
2025-05-15 13:42:28:142 0 sec: 0 operations; est completion in 0 second 
May 15, 2025 1:42:28 PM com.mongodb.diagnostics.logging.JULLogger log
=======
<<<<<<<< Updated upstream:results/nicolò/mongodb/mongo_workloadf_load_rep2_20250508094937.txt
2025-05-08 09:49:40:703 0 sec: 0 operations; est completion in 0 second 
May 08, 2025 9:49:40 AM com.mongodb.diagnostics.logging.JULLogger log
>>>>>>> origin/andrea:results/nicolò/mongodb/mongo_workloadf_load_rep2_20250508094937.txt
INFO: Cluster created with settings {hosts=[mongo-mongos:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://mongo-mongos:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
May 15, 2025 1:42:28 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
May 15, 2025 1:42:28 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1}] to mongo-mongos:27017
May 15, 2025 1:42:28 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=mongo-mongos:27017, type=SHARD_ROUTER, state=CONNECTED, ok=true, version=ServerVersion{versionList=[7, 0, 20]}, minWireVersion=0, maxWireVersion=21, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=999250}
May 15, 2025 1:42:28 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2}] to mongo-mongos:27017
May 15, 2025 1:42:31 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2}] to mongo-mongos:27017 because the pool has been closed.
2025-05-15 13:42:31:800 3 sec: 10000 operations; 2722.57 current ops/sec; [CLEANUP: Count=1, Max=3015, Min=3014, Avg=3015, 90=3015, 99=3015, 99.9=3015, 99.99=3015] [INSERT: Count=10000, Max=49407, Min=175, Avg=346.94, 90=415, 99=600, 99.9=1086, 99.99=11119] 
[OVERALL], RunTime(ms), 3673
[OVERALL], Throughput(ops/sec), 2722.5701061802342
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 5
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1361285053090117
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 5
[TOTAL_GC_TIME_%], Time(%), 0.1361285053090117
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3015.0
[CLEANUP], MinLatency(us), 3014
[CLEANUP], MaxLatency(us), 3015
[CLEANUP], 95thPercentileLatency(us), 3015
[CLEANUP], 99thPercentileLatency(us), 3015
[INSERT], Operations, 10000
<<<<<<< HEAD:results/nicolò/mongo/workloadf/rc10000_oc10000_fc10_fl100_raftrue/load_rep3_2025-05-15_15-42-19.txt
[INSERT], AverageLatency(us), 346.9434
[INSERT], MinLatency(us), 175
[INSERT], MaxLatency(us), 49407
[INSERT], 95thPercentileLatency(us), 467
[INSERT], 99thPercentileLatency(us), 600
=======
[INSERT], AverageLatency(us), 326.7828
[INSERT], MinLatency(us), 146
[INSERT], MaxLatency(us), 41471
[INSERT], 95thPercentileLatency(us), 435
[INSERT], 99thPercentileLatency(us), 607
========
2025-05-18 11:32:47:823 0 sec: 0 operations; est completion in 0 second 
May 18, 2025 11:32:47 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[mongo-mongos:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://mongo-mongos:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
May 18, 2025 11:32:47 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
May 18, 2025 11:32:47 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1}] to mongo-mongos:27017
May 18, 2025 11:32:47 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=mongo-mongos:27017, type=SHARD_ROUTER, state=CONNECTED, ok=true, version=ServerVersion{versionList=[7, 0, 20]}, minWireVersion=0, maxWireVersion=21, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=1648916}
May 18, 2025 11:32:47 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2}] to mongo-mongos:27017
May 18, 2025 11:32:52 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2}] to mongo-mongos:27017 because the pool has been closed.
2025-05-18 11:32:52:795 4 sec: 10000 operations; 2004.01 current ops/sec; [CLEANUP: Count=1, Max=4131, Min=4128, Avg=4130, 90=4131, 99=4131, 99.9=4131, 99.99=4131] [INSERT: Count=10000, Max=59647, Min=250, Avg=474.66, 90=587, 99=1013, 99.9=2419, 99.99=24799] 
[OVERALL], RunTime(ms), 4990
[OVERALL], Throughput(ops/sec), 2004.0080160320642
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 7
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1402805611222445
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 0.1402805611222445
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4130.0
[CLEANUP], MinLatency(us), 4128
[CLEANUP], MaxLatency(us), 4131
[CLEANUP], 95thPercentileLatency(us), 4131
[CLEANUP], 99thPercentileLatency(us), 4131
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 474.6563
[INSERT], MinLatency(us), 250
[INSERT], MaxLatency(us), 59647
[INSERT], 95thPercentileLatency(us), 679
[INSERT], 99thPercentileLatency(us), 1013
>>>>>>>> Stashed changes:results/andrea/mongo/workloadf/rc10000_oc10000_fc10_fl100_raftrue/load_rep3_2025-05-18_13-32-40.txt
>>>>>>> origin/andrea:results/nicolò/mongodb/mongo_workloadf_load_rep2_20250508094937.txt
[INSERT], Return=OK, 10000